
import pyxel as px






SCR_SIZE_MAZE = 80


DRAW_OFFSET_X = 100
DRAW_OFFSET_Y = 14


# 方向
DIRECTION_NORTH = 0
DIRECTION_EAST = 1
DIRECTION_SOUTH = 2
DIRECTION_WEST = 3

# 方向ごとのX, Y増分（上, 右, 下, 左）
VX = [ 0, 1, 0,-1]
VY = [-1, 0, 1, 0]


# 自分の位置と方向からマップのどこを参照するかを、参照順に定義
# 参照順のイメージは以下（上向きである前提、自分の位置はCとする）
# 14マス

# |0|1|2|3|4|
#   |5|6|7|
#   |8|9|A|
#   |B|C|D|
#|(x-2,y-3)|(x-1,y-3)|(x,y-3)|(x+1,y-3)|(x+2,y-3)|
#           |(x-1,y-2)|(x,y-2)|(x+1,y-2)|
#           |(x-1,y-1)|(x,y-1)|(x+1,y-1)|
#           |(x-1,y)  |(x,y)  |(x+1,y)  |

# 以降、時計回りに４方向分

# 中央を最後に処理するように順序を変更
#  |0|1|4|3|2|
#    |5|7|6|
#    |8|A|9|
#    |B|D|C|



POS_X = [
    [-2,-1, 2, 1, 0,-1, 1, 0,-1, 1, 0,-1, 1, 0],
    [ 3, 3, 3, 3, 3, 2, 2, 2, 1, 1, 1, 0, 0, 0],
    [ 2, 1,-2,-1, 0, 1,-1, 0, 1,-1, 0, 1,-1, 0],
    [-3,-3,-3,-3,-3,-2,-2,-2,-1,-1,-1, 0, 0, 0]
]
POS_Y = [
    [-3,-3,-3,-3,-3,-2,-2,-2,-1,-1,-1, 0, 0, 0],
    [-2,-1, 2, 1, 0,-1, 1, 0,-1, 1, 0,-1, 1, 0],
    [ 3, 3, 3, 3, 3, 2, 2, 2, 1, 1, 1, 0, 0, 0],
    [ 2, 1,-2,-1, 0, 1,-1, 0, 1,-1, 0, 1,-1, 0]
]


# WALL_COLOR = [
#     px.COLOR_RED,
#     px.COLOR_YELLOW,
#     px.COLOR_GREEN,
#     px.COLOR_LIGHT_BLUE,
# ]
WALL_COLOR = [
    px.COLOR_LIGHT_BLUE,
    px.COLOR_DARK_BLUE,
    px.COLOR_NAVY,
    px.COLOR_BLACK,
    px.COLOR_BROWN
]
#    (10, 25, 30, 35) ( 45, 50, 55, 70)
# WALL_LENGTH = [
#     60,
#     30,
#     20,
#     10,
# ]
# WALL_LEFT = [
#     (15, 35),
#     (25, 35),
#     (55, 35),
#     (45, 35),
#     (35, 35),

#     (10, 30),
#     (50, 30),
#     (30, 30),      

#     (-5, 25),
#     (55, 25),
#     (25, 25),

#     (-50, 10),
#     ( 70, 10),
#     ( 10, 10),
# ]

WALL_LENGTH = [
    80,
    60,
    30,
    20,
    10,
]

#  |0|1|4|3|2|
#    |5|7|6|
#    |8|A|9|
#    |B|D|C|

WALL_TERMINAL = [
    (-1, -1),
    (25, 35),
    (-1, -1),
    (45, 35),
    (35, 35),
]
WALL_LEFT = [
    (-1, -1),
    (10, 30),
    (-1, -1),
    (50, 30),
    (30, 30),

    (-5, 25),
    (55, 25),
    (25, 25),

    (-50, 10),
    ( 70, 10),
    ( 10, 10),

    (-80, 0),
    ( 80, 0),
    (  0, 0),
]

